Documents/ДоговорРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ДоговорРеструктуризацииДолга</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлатежиПоРеструктуризацииДолга</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслуги</xr:Item>
				<xr:Item>InformationRegister.СостояниеРеструктуризацииДолга</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРассрочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияРассрочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийДоговораРеструктуризацииДолга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураДолга</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийДоговораРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийДоговораРеструктуризацииДолга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаключениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасторжениеДоговора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДоговорРеструктуризацииДолга/Ext/ObjectModule.bsl
// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Контроль відповідності графіка сумі боргу (для укладення).
	Если ВидОперации = Перечисления.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора Тогда
		Если СтруктураДолга.Количество() = 0 Тогда
			Сообщить("Не заповнено графік розстрочки (СтруктураДолга).");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Если Окр(СтруктураДолга.Итог("СуммаПлатежа") - СуммаДолга, 2) <> 0 Тогда
			Сообщить("Сума графіка не дорівнює сумі боргу. Скористайтеся командою «Распределить».");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ДоговорРеструктуризацииДолга.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	//ПроведениеСервер.ОтразитьНазначенныеУслуги(ДополнительныеСвойства, Движения, Отказ);
	Если ВидОперации = Перечисления.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора Тогда
		ПроведениеСервер.ОтразитьНачисленияПоРеструктуризацииДолга(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	ПроведениеСервер.ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьСостояниеРеструктуризации(ДополнительныеСвойства, Движения, Отказ);


	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

//Процедура - обработчик события ПередЗаписью объекта.
//Прверяется наличие документов реструктуризации в том же периоде что и текщий документ 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
		                |	ДоговорРеструктуризацииДолга.Ссылка
		                |ИЗ
		                |	Документ.ДоговорРеструктуризацииДолга КАК ДоговорРеструктуризацииДолга
		                |ГДЕ
		                |	ДоговорРеструктуризацииДолга.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		                |	И ДоговорРеструктуризацииДолга.ЛицевойСчет = &ЛицевойСчет
		                |	И ДоговорРеструктуризацииДолга.Проведен = ИСТИНА
		                |	И ДоговорРеструктуризацииДолга.Ссылка <> &Ссылка" ;
		Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
		Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Дата));
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		Результат = Запрос.Выполнить();

		Если НЕ Результат.Пустой() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "По цьому особовому рахунку вже є проведений договір реструктуризації за цей місяць.";
			Сообщение.Поле = "ЛицевойСчет";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
